// lvalues_and_rvalues2.cpp
int main()
{
    int i, j, * p;

    // 正确用法：变量 i 是左值，文字 7 是纯右值。
    i = 7;

    // 错误用法：左操作数必须是左值 (C2106)。`j * 4` 是纯右值。
  //  7 = i; // C2106
 //   j * 4 = 7; // C2106

    /*
    // C2106.cpp
   int main() {
   int a;
   1 = a;   // C2106
   a = 1;   // OK
}
    */
 
    // 正确用法：解引用的指针是左值。
   p = &i; //ok 改变左值


 //  p = new int();  //不建议这样写
  //  *p = i;  // ok 改变右值成功  //不建议这样写



    // 正确用法：条件运算符返回左值。
    ((i < 3) ? i : j) = 7;

    // 错误用法：常量 ci 是不可修改的左值 (C3892)。
    const int ci = 7;
   // ci = 9; // C3892
}